muvox-io/euphonium/targets/esp32/app/sdkconfig.defaults
# CONFIG_ESP32_TRAX is not set
    CONFIG_ESP32_TRACEMEM_RESERVE_DRAM=0x0
# CONFIG_ESP32_ULP_COPROC_ENABLED is not set
    CONFIG_ESP32_ULP_COPROC_RESERVE_MEM=0
    CONFIG_ESP32_DEBUG_OCDAWARE=y
        CONFIG_ESP32_BROWNOUT_DET=y
            CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_0=y
# CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_1 is not set
# CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_2 is not set
# CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_3 is not set
# CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_4 is not set
# CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_5 is not set
# CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_6 is not set
# CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_7 is not set
                CONFIG_ESP32_BROWNOUT_DET_LVL=0
    CONFIG_ESP32_TIME_SYSCALL_USE_RTC_FRC1=y
# CONFIG_ESP32_TIME_SYSCALL_USE_RTC is not set
# CONFIG_ESP32_TIME_SYSCALL_USE_FRC1 is not set
# CONFIG_ESP32_TIME_SYSCALL_USE_NONE is not set
        CONFIG_ESP32_RTC_CLK_SRC_INT_RC=y
# CONFIG_ESP32_RTC_CLK_SRC_EXT_CRYS is not set
# CONFIG_ESP32_RTC_CLK_SRC_EXT_OSC is not set
# CONFIG_ESP32_RTC_CLK_SRC_INT_8MD256 is not set
            CONFIG_ESP32_RTC_CLK_CAL_CYCLES=1024
    CONFIG_ESP32_DEEP_SLEEP_WAKEUP_DELAY=2000
    CONFIG_ESP32_XTAL_FREQ_40=y
# CONFIG_ESP32_XTAL_FREQ_26 is not set
# CONFIG_ESP32_XTAL_FREQ_AUTO is not set
        CONFIG_ESP32_XTAL_FREQ=40
# CONFIG_ESP32_DISABLE_BASIC_ROM_CONSOLE is not set
# CONFIG_ESP32_COMPATIBLE_PRE_V2_1_BOOTLOADERS is not set
# CONFIG_ESP32_COMPATIBLE_PRE_V3_1_BOOTLOADERS is not set
# CONFIG_ESP32_USE_FIXED_STATIC_RAM_SIZE is not set
    CONFIG_ESP32_DPORT_DIS_INTERRUPT_LVL=5
# end of ESP32-specific

#
# ADC-Calibration
#
    CONFIG_ADC_CAL_EFUSE_TP_ENABLE=y
        CONFIG_ADC_CAL_EFUSE_VREF_ENABLE=y
            CONFIG_ADC_CAL_LUT_ENABLE=y
# end of ADC-Calibration

#
# Common ESP-related
#
                CONFIG_ESP_ERR_TO_NAME_LOOKUP=y
                    CONFIG_ESP_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# end of Common ESP-related

#
# Ethernet
#
# CONFIG_ETH_USE_ESP32_EMAC is not set
# CONFIG_ETH_USE_SPI_ETHERNET is not set
# CONFIG_ETH_USE_OPENETH is not set
# end of Ethernet

#
# Event Loop Library
#
# CONFIG_ESP_EVENT_LOOP_PROFILING is not set
                        CONFIG_ESP_EVENT_POST_FROM_ISR=y
                            CONFIG_ESP_EVENT_POST_FROM_IRAM_ISR=y
# end of Event Loop Library

#
# GDB Stub
#
# end of GDB Stub

#
# ESP HTTP client
#
                                CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
# CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH is not set
                                    CONFIG_ESP_HTTP_CLIENT_ENABLE_DIGEST_AUTH=y
# end of ESP HTTP client

#
# HTTP Server
#
                                        CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
    CONFIG_HTTPD_MAX_URI_LEN=512
    CONFIG_HTTPD_ERR_RESP_NO_DELAY=y
        CONFIG_HTTPD_PURGE_BUF_LEN=32
# CONFIG_HTTPD_LOG_PURGE_DATA is not set
# CONFIG_HTTPD_WS_SUPPORT is not set
# end of HTTP Server

#
# ESP HTTPS OTA
#
    CONFIG_OTA_ALLOW_HTTP=y
# end of ESP HTTPS OTA

#
# ESP HTTPS server
#
# CONFIG_ESP_HTTPS_SERVER_ENABLE is not set
# end of ESP HTTPS server

#
# Hardware Settings
#

#
# MAC Config
#
        CONFIG_ESP_MAC_ADDR_UNIVERSE_WIFI_STA=y
            CONFIG_ESP_MAC_ADDR_UNIVERSE_WIFI_AP=y
                CONFIG_ESP_MAC_ADDR_UNIVERSE_BT=y
                    CONFIG_ESP_MAC_ADDR_UNIVERSE_ETH=y
# CONFIG_ESP32_UNIVERSAL_MAC_ADDRESSES_TWO is not set
                        CONFIG_ESP32_UNIVERSAL_MAC_ADDRESSES_FOUR=y
                            CONFIG_ESP32_UNIVERSAL_MAC_ADDRESSES=4
# end of MAC Config

#
# Sleep Config
#
    CONFIG_ESP_SLEEP_RTC_BUS_ISO_WORKAROUND=y
# CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND is not set
# CONFIG_ESP_SLEEP_PSRAM_LEAKAGE_WORKAROUND is not set
# CONFIG_ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND is not set
# end of Sleep Config
# end of Hardware Settings

#
# IPC (Inter-Processor Call)
#
        CONFIG_ESP_IPC_TASK_STACK_SIZE=1024
    CONFIG_ESP_IPC_USES_CALLERS_PRIORITY=y
        CONFIG_ESP_IPC_ISR_ENABLE=y
# end of IPC (Inter-Processor Call)

#
# LCD and Touch Panel
#

#
# LCD Peripheral Configuration
#
            CONFIG_LCD_PANEL_IO_FORMAT_BUF_SIZE=32
# end of LCD Peripheral Configuration
# end of LCD and Touch Panel

#
# ESP NETIF Adapter
#
    CONFIG_ESP_NETIF_IP_LOST_TIMER_INTERVAL=120
    CONFIG_ESP_NETIF_TCPIP_LWIP=y
# CONFIG_ESP_NETIF_LOOPBACK is not set
        CONFIG_ESP_NETIF_TCPIP_ADAPTER_COMPATIBLE_LAYER=y
# end of ESP NETIF Adapter

#
# PHY
#
            CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE=y
# CONFIG_ESP_PHY_INIT_DATA_IN_PARTITION is not set
                CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=20
    CONFIG_ESP_PHY_MAX_TX_POWER=20
    CONFIG_ESP_PHY_REDUCE_TX_POWER=y
# end of PHY

#
# Power Management
#
# CONFIG_PM_ENABLE is not set
# end of Power Management

#
# ESP System Settings
#
# CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT is not set
        CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
# CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT is not set
# CONFIG_ESP_SYSTEM_PANIC_GDBSTUB is not set
# CONFIG_ESP_SYSTEM_GDBSTUB_RUNTIME is not set

#
# Memory protection
#
# end of Memory protection

            CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=32
    CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=2304
    CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
    CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
# CONFIG_ESP_MAIN_TASK_AFFINITY_CPU1 is not set
# CONFIG_ESP_MAIN_TASK_AFFINITY_NO_AFFINITY is not set
        CONFIG_ESP_MAIN_TASK_AFFINITY=0x0
    CONFIG_ESP_MINIMAL_SHARED_STACK_SIZE=2048
    CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# CONFIG_ESP_CONSOLE_UART_CUSTOM is not set
# CONFIG_ESP_CONSOLE_NONE is not set
        CONFIG_ESP_CONSOLE_UART=y
            CONFIG_ESP_CONSOLE_MULTIPLE_UART=y
                CONFIG_ESP_CONSOLE_UART_NUM=0
    CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
    CONFIG_ESP_INT_WDT=y
        CONFIG_ESP_INT_WDT_TIMEOUT_MS=800
    CONFIG_ESP_INT_WDT_CHECK_CPU1=y
        CONFIG_ESP_TASK_WDT=y
# CONFIG_ESP_TASK_WDT_PANIC is not set
            CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
    CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
        CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
# CONFIG_ESP_PANIC_HANDLER_IRAM is not set
            CONFIG_ESP_SYSTEM_CHECK_INT_LEVEL_5=y
# end of ESP System Settings

#
# High resolution timer (esp_timer)
#
# CONFIG_ESP_TIMER_PROFILING is not set
                CONFIG_ESP_TIME_FUNCS_USE_RTC_TIMER=y
                    CONFIG_ESP_TIME_FUNCS_USE_ESP_TIMER=y
                        CONFIG_ESP_TIMER_TASK_STACK_SIZE=3584
    CONFIG_ESP_TIMER_INTERRUPT_LEVEL=1
# CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD is not set
# CONFIG_ESP_TIMER_IMPL_FRC2 is not set
    CONFIG_ESP_TIMER_IMPL_TG0_LAC=y
# end of High resolution timer (esp_timer)

#
# Wi-Fi
#
        CONFIG_ESP32_WIFI_ENABLED=y
            CONFIG_ESP32_WIFI_SW_COEXIST_ENABLE=y
                CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=12
    CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=40
    CONFIG_ESP32_WIFI_STATIC_TX_BUFFER=y
        CONFIG_ESP32_WIFI_TX_BUFFER_TYPE=0
    CONFIG_ESP32_WIFI_STATIC_TX_BUFFER_NUM=12
    CONFIG_ESP32_WIFI_CACHE_TX_BUFFER_NUM=32
# CONFIG_ESP32_WIFI_CSI_ENABLED is not set
# CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED is not set
# CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED is not set
# CONFIG_ESP32_WIFI_AMSDU_TX_ENABLED is not set
    CONFIG_ESP32_WIFI_NVS_ENABLED=y
        CONFIG_ESP32_WIFI_TASK_PINNED_TO_CORE_0=y
# CONFIG_ESP32_WIFI_TASK_PINNED_TO_CORE_1 is not set
            CONFIG_ESP32_WIFI_SOFTAP_BEACON_MAX_LEN=752
    CONFIG_ESP32_WIFI_MGMT_SBUF_NUM=32
# CONFIG_ESP32_WIFI_IRAM_OPT is not set
# CONFIG_ESP32_WIFI_RX_IRAM_OPT is not set
    CONFIG_ESP32_WIFI_ENABLE_WPA3_SAE=y
# CONFIG_ESP_WIFI_SLP_IRAM_OPT is not set
# CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE is not set
# CONFIG_ESP_WIFI_GMAC_SUPPORT is not set
        CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
# end of Wi-Fi

#
# Core dump
#
            CONFIG_ESP_COREDUMP_ENABLE_TO_UART=y
# CONFIG_ESP_COREDUMP_ENABLE_TO_NONE is not set
# CONFIG_ESP_COREDUMP_DATA_FORMAT_BIN is not set
                CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
                    CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
# CONFIG_ESP_COREDUMP_CHECKSUM_SHA256 is not set
                        CONFIG_ESP_COREDUMP_ENABLE=y
                            CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=64
    CONFIG_ESP_COREDUMP_UART_DELAY=0
    CONFIG_ESP_COREDUMP_DECODE_INFO=y
# CONFIG_ESP_COREDUMP_DECODE_DISABLE is not set
        CONFIG_ESP_COREDUMP_DECODE="info"
# end of Core dump

#
# FAT Filesystem support
#
# CONFIG_FATFS_CODEPAGE_DYNAMIC is not set
    CONFIG_FATFS_CODEPAGE_437=y
# CONFIG_FATFS_CODEPAGE_720 is not set
# CONFIG_FATFS_CODEPAGE_737 is not set
# CONFIG_FATFS_CODEPAGE_771 is not set
# CONFIG_FATFS_CODEPAGE_775 is not set
# CONFIG_FATFS_CODEPAGE_850 is not set
# CONFIG_FATFS_CODEPAGE_852 is not set
# CONFIG_FATFS_CODEPAGE_855 is not set
# CONFIG_FATFS_CODEPAGE_857 is not set
# CONFIG_FATFS_CODEPAGE_860 is not set
# CONFIG_FATFS_CODEPAGE_861 is not set
# CONFIG_FATFS_CODEPAGE_862 is not set
# CONFIG_FATFS_CODEPAGE_863 is not set
# CONFIG_FATFS_CODEPAGE_864 is not set
# CONFIG_FATFS_CODEPAGE_865 is not set
# CONFIG_FATFS_CODEPAGE_866 is not set
# CONFIG_FATFS_CODEPAGE_869 is not set
# CONFIG_FATFS_CODEPAGE_932 is not set
# CONFIG_FATFS_CODEPAGE_936 is not set
# CONFIG_FATFS_CODEPAGE_949 is not set
# CONFIG_FATFS_CODEPAGE_950 is not set
        CONFIG_FATFS_CODEPAGE=437
    CONFIG_FATFS_LFN_NONE=y
# CONFIG_FATFS_LFN_HEAP is not set
# CONFIG_FATFS_LFN_STACK is not set
        CONFIG_FATFS_FS_LOCK=0
    CONFIG_FATFS_TIMEOUT_MS=10000
    CONFIG_FATFS_PER_FILE_CACHE=y
        CONFIG_FATFS_ALLOC_PREFER_EXTRAM=y
# CONFIG_FATFS_USE_FASTSEEK is not set
# end of FAT Filesystem support

#
# Modbus configuration
#
            CONFIG_FMB_COMM_MODE_TCP_EN=y
                CONFIG_FMB_TCP_PORT_DEFAULT=502
    CONFIG_FMB_TCP_PORT_MAX_CONN=5
    CONFIG_FMB_TCP_CONNECTION_TOUT_SEC=20
    CONFIG_FMB_COMM_MODE_RTU_EN=y
        CONFIG_FMB_COMM_MODE_ASCII_EN=y
            CONFIG_FMB_MASTER_TIMEOUT_MS_RESPOND=150
    CONFIG_FMB_MASTER_DELAY_MS_CONVERT=200
    CONFIG_FMB_QUEUE_LENGTH=20
    CONFIG_FMB_PORT_TASK_STACK_SIZE=4096
    CONFIG_FMB_SERIAL_BUF_SIZE=256
    CONFIG_FMB_SERIAL_ASCII_BITS_PER_SYMB=8
    CONFIG_FMB_SERIAL_ASCII_TIMEOUT_RESPOND_MS=1000
    CONFIG_FMB_PORT_TASK_PRIO=10
# CONFIG_FMB_PORT_TASK_AFFINITY_NO_AFFINITY is not set
    CONFIG_FMB_PORT_TASK_AFFINITY_CPU0=y
# CONFIG_FMB_PORT_TASK_AFFINITY_CPU1 is not set
        CONFIG_FMB_PORT_TASK_AFFINITY=0x0
# CONFIG_FMB_CONTROLLER_SLAVE_ID_SUPPORT is not set
    CONFIG_FMB_CONTROLLER_NOTIFY_TIMEOUT=20
    CONFIG_FMB_CONTROLLER_NOTIFY_QUEUE_SIZE=20
    CONFIG_FMB_CONTROLLER_STACK_SIZE=4096
    CONFIG_FMB_EVENT_QUEUE_TIMEOUT=20
    CONFIG_FMB_TIMER_PORT_ENABLED=y
        CONFIG_FMB_TIMER_GROUP=0
    CONFIG_FMB_TIMER_INDEX=0
    CONFIG_FMB_MASTER_TIMER_GROUP=0
    CONFIG_FMB_MASTER_TIMER_INDEX=0
# CONFIG_FMB_TIMER_ISR_IN_IRAM is not set
# end of Modbus configuration

#
# FreeRTOS
#
# CONFIG_FREERTOS_UNICORE is not set
    CONFIG_FREERTOS_NO_AFFINITY=0x7FFFFFFF
    CONFIG_FREERTOS_TICK_SUPPORT_CORETIMER=y
        CONFIG_FREERTOS_CORETIMER_0=y
# CONFIG_FREERTOS_CORETIMER_1 is not set
            CONFIG_FREERTOS_SYSTICK_USES_CCOUNT=y
                CONFIG_FREERTOS_HZ=100
    CONFIG_FREERTOS_ASSERT_ON_UNTESTED_FUNCTION=y
# CONFIG_FREERTOS_CHECK_STACKOVERFLOW_NONE is not set
# CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL is not set
        CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
# CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK is not set
            CONFIG_FREERTOS_INTERRUPT_BACKTRACE=y
                CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=1
    CONFIG_FREERTOS_ASSERT_FAIL_ABORT=y
# CONFIG_FREERTOS_ASSERT_FAIL_PRINT_CONTINUE is not set
# CONFIG_FREERTOS_ASSERT_DISABLE is not set
        CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1536
    CONFIG_FREERTOS_ISR_STACKSIZE=2096
# CONFIG_FREERTOS_LEGACY_HOOKS is not set
    CONFIG_FREERTOS_MAX_TASK_NAME_LEN=16
    CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
# CONFIG_FREERTOS_ENABLE_STATIC_TASK_CLEAN_UP is not set
        CONFIG_FREERTOS_TIMER_TASK_PRIORITY=1
    CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=2432
    CONFIG_FREERTOS_TIMER_QUEUE_LENGTH=10
    CONFIG_FREERTOS_QUEUE_REGISTRY_SIZE=0
    CONFIG_FREERTOS_USE_TRACE_FACILITY=y
        CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
            CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
# CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS is not set
                CONFIG_FREERTOS_CHECK_MUTEX_GIVEN_BY_OWNER=y
# CONFIG_FREERTOS_CHECK_PORT_CRITICAL_COMPLIANCE is not set
# CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH is not set
                    CONFIG_FREERTOS_DEBUG_OCDAWARE=y
# CONFIG_FREERTOS_FPU_IN_ISR is not set
                        CONFIG_FREERTOS_ENABLE_TASK_SNAPSHOT=y
# CONFIG_FREERTOS_PLACE_SNAPSHOT_FUNS_INTO_FLASH is not set
# end of FreeRTOS

#
# Hardware Abstraction Layer (HAL) and Low Level (LL)
#
                            CONFIG_HAL_ASSERTION_EQUALS_SYSTEM=y
# CONFIG_HAL_ASSERTION_DISABLE is not set
# CONFIG_HAL_ASSERTION_SILIENT is not set
# CONFIG_HAL_ASSERTION_ENABLE is not set
                                CONFIG_HAL_DEFAULT_ASSERTION_LEVEL=2
# end of Hardware Abstraction Layer (HAL) and Low Level (LL)

#
# Heap memory debugging
#
    CONFIG_HEAP_POISONING_DISABLED=y
# CONFIG_HEAP_POISONING_LIGHT is not set
# CONFIG_HEAP_POISONING_COMPREHENSIVE is not set
        CONFIG_HEAP_TRACING_OFF=y
# CONFIG_HEAP_TRACING_STANDALONE is not set
# CONFIG_HEAP_TRACING_TOHOST is not set
# CONFIG_HEAP_ABORT_WHEN_ALLOCATION_FAILS is not set
# end of Heap memory debugging

#
# jsmn
#
# CONFIG_JSMN_PARENT_LINKS is not set
# CONFIG_JSMN_STRICT is not set
# end of jsmn

#
# libsodium
#
# end of libsodium

#
# Log output
#
# CONFIG_LOG_DEFAULT_LEVEL_NONE is not set
# CONFIG_LOG_DEFAULT_LEVEL_ERROR is not set
# CONFIG_LOG_DEFAULT_LEVEL_WARN is not set
            CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# CONFIG_LOG_DEFAULT_LEVEL_DEBUG is not set
# CONFIG_LOG_DEFAULT_LEVEL_VERBOSE is not set
                CONFIG_LOG_DEFAULT_LEVEL=3
    CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
# CONFIG_LOG_MAXIMUM_LEVEL_DEBUG is not set
# CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE is not set
        CONFIG_LOG_MAXIMUM_LEVEL=3
    CONFIG_LOG_COLORS=y
        CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y
# CONFIG_LOG_TIMESTAMP_SOURCE_SYSTEM is not set
# end of Log output

#
# LWIP
#
            CONFIG_LWIP_LOCAL_HOSTNAME="squeezelite-esp32"
# CONFIG_LWIP_NETIF_API is not set
# CONFIG_LWIP_TCPIP_CORE_LOCKING is not set
    CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y
# CONFIG_LWIP_L2_TO_L3_COPY is not set
# CONFIG_LWIP_IRAM_OPTIMIZATION is not set
        CONFIG_LWIP_TIMERS_ONDEMAND=y
            CONFIG_LWIP_MAX_SOCKETS=16
# CONFIG_LWIP_USE_ONLY_LWIP_SELECT is not set
# CONFIG_LWIP_SO_LINGER is not set
    CONFIG_LWIP_SO_REUSE=y
        CONFIG_LWIP_SO_REUSE_RXTOALL=y
# CONFIG_LWIP_SO_RCVBUF is not set
# CONFIG_LWIP_NETBUF_RECVINFO is not set
            CONFIG_LWIP_IP4_FRAG=y
                CONFIG_LWIP_IP6_FRAG=y
# CONFIG_LWIP_IP4_REASSEMBLY is not set
# CONFIG_LWIP_IP6_REASSEMBLY is not set
# CONFIG_LWIP_IP_FORWARD is not set
# CONFIG_LWIP_STATS is not set
# CONFIG_LWIP_ETHARP_TRUST_IP_MAC is not set
                    CONFIG_LWIP_ESP_GRATUITOUS_ARP=y
                        CONFIG_LWIP_GARP_TMR_INTERVAL=60
    CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
    CONFIG_LWIP_DHCP_DOES_ARP_CHECK=y
# CONFIG_LWIP_DHCP_DISABLE_CLIENT_ID is not set
        CONFIG_LWIP_DHCP_DISABLE_VENDOR_CLASS_ID=y
            CONFIG_LWIP_DHCP_RESTORE_LAST_IP=y
                CONFIG_LWIP_DHCP_OPTIONS_LEN=68

#
# DHCP server
#
    CONFIG_LWIP_DHCPS=y
        CONFIG_LWIP_DHCPS_LEASE_UNIT=60
    CONFIG_LWIP_DHCPS_MAX_STATION_NUM=8
# end of DHCP server

# CONFIG_LWIP_AUTOIP is not set
    CONFIG_LWIP_IPV6=y
# CONFIG_LWIP_IPV6_AUTOCONFIG is not set
        CONFIG_LWIP_IPV6_NUM_ADDRESSES=3
# CONFIG_LWIP_IPV6_FORWARD is not set
# CONFIG_LWIP_NETIF_STATUS_CALLBACK is not set
    CONFIG_LWIP_NETIF_LOOPBACK=y
        CONFIG_LWIP_LOOPBACK_MAX_PBUFS=8

#
# TCP
#
    CONFIG_LWIP_MAX_ACTIVE_TCP=16
    CONFIG_LWIP_MAX_LISTENING_TCP=16
    CONFIG_LWIP_TCP_HIGH_SPEED_RETRANSMISSION=y
        CONFIG_LWIP_TCP_MAXRTX=12
    CONFIG_LWIP_TCP_SYNMAXRTX=6
    CONFIG_LWIP_TCP_MSS=1440
    CONFIG_LWIP_TCP_TMR_INTERVAL=250
    CONFIG_LWIP_TCP_MSL=60000
    CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8192
    CONFIG_LWIP_TCP_WND_DEFAULT=32768
    CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
    CONFIG_LWIP_TCP_QUEUE_OOSEQ=y
# CONFIG_LWIP_TCP_SACK_OUT is not set
# CONFIG_LWIP_TCP_KEEP_CONNECTION_WHEN_IP_CHANGES is not set
        CONFIG_LWIP_TCP_OVERSIZE_MSS=y
# CONFIG_LWIP_TCP_OVERSIZE_QUARTER_MSS is not set
# CONFIG_LWIP_TCP_OVERSIZE_DISABLE is not set
# CONFIG_LWIP_WND_SCALE is not set
            CONFIG_LWIP_TCP_RTO_TIME=1500
# end of TCP

#
# UDP
#
    CONFIG_LWIP_MAX_UDP_PCBS=16
    CONFIG_LWIP_UDP_RECVMBOX_SIZE=32
# end of UDP

#
# Checksums
#
# CONFIG_LWIP_CHECKSUM_CHECK_IP is not set
# CONFIG_LWIP_CHECKSUM_CHECK_UDP is not set
    CONFIG_LWIP_CHECKSUM_CHECK_ICMP=y
# end of Checksums

        CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=3072
    CONFIG_LWIP_TCPIP_TASK_AFFINITY_NO_AFFINITY=y
# CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0 is not set
# CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU1 is not set
        CONFIG_LWIP_TCPIP_TASK_AFFINITY=0x7FFFFFFF
# CONFIG_LWIP_PPP_SUPPORT is not set
    CONFIG_LWIP_IPV6_MEMP_NUM_ND6_QUEUE=3
    CONFIG_LWIP_IPV6_ND6_NUM_NEIGHBORS=5
# CONFIG_LWIP_SLIP_SUPPORT is not set

#
# ICMP
#
    CONFIG_LWIP_ICMP=y
# CONFIG_LWIP_MULTICAST_PING is not set
# CONFIG_LWIP_BROADCAST_PING is not set
# end of ICMP

#
# LWIP RAW API
#
        CONFIG_LWIP_MAX_RAW_PCBS=16
# end of LWIP RAW API

#
# SNTP
#
    CONFIG_LWIP_SNTP_MAX_SERVERS=1
# CONFIG_LWIP_DHCP_GET_NTP_SRV is not set
    CONFIG_LWIP_SNTP_UPDATE_DELAY=3600000
# end of SNTP

    CONFIG_LWIP_ESP_LWIP_ASSERT=y

