muvox-io/euphonium/targets/esp32/app/sdkconfig.defaults
#
# Hooks
#
# CONFIG_LWIP_HOOK_TCP_ISN_NONE is not set
        CONFIG_LWIP_HOOK_TCP_ISN_DEFAULT=y
# CONFIG_LWIP_HOOK_TCP_ISN_CUSTOM is not set
            CONFIG_LWIP_HOOK_IP6_ROUTE_NONE=y
# CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT is not set
# CONFIG_LWIP_HOOK_IP6_ROUTE_CUSTOM is not set
                CONFIG_LWIP_HOOK_ND6_GET_GW_NONE=y
# CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT is not set
# CONFIG_LWIP_HOOK_ND6_GET_GW_CUSTOM is not set
                    CONFIG_LWIP_HOOK_NETCONN_EXT_RESOLVE_NONE=y
# CONFIG_LWIP_HOOK_NETCONN_EXT_RESOLVE_DEFAULT is not set
# CONFIG_LWIP_HOOK_NETCONN_EXT_RESOLVE_CUSTOM is not set
# end of Hooks

# CONFIG_LWIP_DEBUG is not set
# end of LWIP

#
# mbedTLS
#
# CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC is not set
                        CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC is not set
# CONFIG_MBEDTLS_CUSTOM_MEM_ALLOC is not set
                            CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384
# CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN is not set
# CONFIG_MBEDTLS_DYNAMIC_BUFFER is not set
# CONFIG_MBEDTLS_DEBUG is not set

#
# Certificate Bundle
#
    CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
        CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN is not set
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_NONE is not set
# CONFIG_MBEDTLS_CUSTOM_CERTIFICATE_BUNDLE is not set
# end of Certificate Bundle

# CONFIG_MBEDTLS_ECP_RESTARTABLE is not set
# CONFIG_MBEDTLS_CMAC_C is not set
# CONFIG_MBEDTLS_HARDWARE_AES is not set
            CONFIG_MBEDTLS_HARDWARE_MPI=y
                CONFIG_MBEDTLS_HARDWARE_SHA=y
                    CONFIG_MBEDTLS_ROM_MD5=y
# CONFIG_MBEDTLS_ATCA_HW_ECDSA_SIGN is not set
# CONFIG_MBEDTLS_ATCA_HW_ECDSA_VERIFY is not set
                        CONFIG_MBEDTLS_HAVE_TIME=y
# CONFIG_MBEDTLS_HAVE_TIME_DATE is not set
                            CONFIG_MBEDTLS_ECDSA_DETERMINISTIC=y
                                CONFIG_MBEDTLS_SHA512_C=y
# CONFIG_MBEDTLS_TLS_SERVER_AND_CLIENT is not set
# CONFIG_MBEDTLS_TLS_SERVER_ONLY is not set
                                    CONFIG_MBEDTLS_TLS_CLIENT_ONLY=y
# CONFIG_MBEDTLS_TLS_DISABLED is not set
                                        CONFIG_MBEDTLS_TLS_CLIENT=y
                                            CONFIG_MBEDTLS_TLS_ENABLED=y

#
# TLS Key Exchange Methods
#
# CONFIG_MBEDTLS_PSK_MODES is not set
                                                CONFIG_MBEDTLS_KEY_EXCHANGE_RSA=y
                                                    CONFIG_MBEDTLS_KEY_EXCHANGE_DHE_RSA=y
                                                        CONFIG_MBEDTLS_KEY_EXCHANGE_ELLIPTIC_CURVE=y
                                                            CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_RSA=y
                                                                CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_ECDSA=y
                                                                    CONFIG_MBEDTLS_KEY_EXCHANGE_ECDH_ECDSA=y
                                                                        CONFIG_MBEDTLS_KEY_EXCHANGE_ECDH_RSA=y
# end of TLS Key Exchange Methods

                                                                            CONFIG_MBEDTLS_SSL_RENEGOTIATION=y
# CONFIG_MBEDTLS_SSL_PROTO_SSL3 is not set
# CONFIG_MBEDTLS_SSL_PROTO_TLS1 is not set
                                                                                CONFIG_MBEDTLS_SSL_PROTO_TLS1_1=y
                                                                                    CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
# CONFIG_MBEDTLS_SSL_PROTO_GMTSSL1_1 is not set
# CONFIG_MBEDTLS_SSL_PROTO_DTLS is not set
                                                                                        CONFIG_MBEDTLS_SSL_ALPN=y
                                                                                            CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS=y
                                                                                                CONFIG_MBEDTLS_X509_CHECK_KEY_USAGE=y
                                                                                                    CONFIG_MBEDTLS_X509_CHECK_EXTENDED_KEY_USAGE=y
                                                                                                        CONFIG_MBEDTLS_SERVER_SSL_SESSION_TICKETS=y

#
# Symmetric Ciphers
#
                                                                                                            CONFIG_MBEDTLS_AES_C=y
# CONFIG_MBEDTLS_CAMELLIA_C is not set
# CONFIG_MBEDTLS_DES_C is not set
                                                                                                                CONFIG_MBEDTLS_RC4_DISABLED=y
# CONFIG_MBEDTLS_RC4_ENABLED_NO_DEFAULT is not set
# CONFIG_MBEDTLS_RC4_ENABLED is not set
# CONFIG_MBEDTLS_BLOWFISH_C is not set
# CONFIG_MBEDTLS_XTEA_C is not set
                                                                                                                    CONFIG_MBEDTLS_CCM_C=y
                                                                                                                        CONFIG_MBEDTLS_GCM_C=y
# CONFIG_MBEDTLS_NIST_KW_C is not set
# end of Symmetric Ciphers

# CONFIG_MBEDTLS_RIPEMD160_C is not set

#
# Certificates
#
                                                                                                                            CONFIG_MBEDTLS_PEM_PARSE_C=y
                                                                                                                                CONFIG_MBEDTLS_PEM_WRITE_C=y
                                                                                                                                    CONFIG_MBEDTLS_X509_CRL_PARSE_C=y
                                                                                                                                        CONFIG_MBEDTLS_X509_CSR_PARSE_C=y
# end of Certificates

                                                                                                                                            CONFIG_MBEDTLS_ECP_C=y
                                                                                                                                                CONFIG_MBEDTLS_ECDH_C=y
                                                                                                                                                    CONFIG_MBEDTLS_ECDSA_C=y
# CONFIG_MBEDTLS_ECJPAKE_C is not set
                                                                                                                                                        CONFIG_MBEDTLS_ECP_DP_SECP192R1_ENABLED=y
                                                                                                                                                            CONFIG_MBEDTLS_ECP_DP_SECP224R1_ENABLED=y
                                                                                                                                                                CONFIG_MBEDTLS_ECP_DP_SECP256R1_ENABLED=y
                                                                                                                                                                    CONFIG_MBEDTLS_ECP_DP_SECP384R1_ENABLED=y
                                                                                                                                                                        CONFIG_MBEDTLS_ECP_DP_SECP521R1_ENABLED=y
                                                                                                                                                                            CONFIG_MBEDTLS_ECP_DP_SECP192K1_ENABLED=y
                                                                                                                                                                                CONFIG_MBEDTLS_ECP_DP_SECP224K1_ENABLED=y
                                                                                                                                                                                    CONFIG_MBEDTLS_ECP_DP_SECP256K1_ENABLED=y
                                                                                                                                                                                        CONFIG_MBEDTLS_ECP_DP_BP256R1_ENABLED=y
                                                                                                                                                                                            CONFIG_MBEDTLS_ECP_DP_BP384R1_ENABLED=y
                                                                                                                                                                                                CONFIG_MBEDTLS_ECP_DP_BP512R1_ENABLED=y
                                                                                                                                                                                                    CONFIG_MBEDTLS_ECP_DP_CURVE25519_ENABLED=y
                                                                                                                                                                                                        CONFIG_MBEDTLS_ECP_NIST_OPTIM=y
# CONFIG_MBEDTLS_POLY1305_C is not set
# CONFIG_MBEDTLS_CHACHA20_C is not set
# CONFIG_MBEDTLS_HKDF_C is not set
# CONFIG_MBEDTLS_THREADING_C is not set
# CONFIG_MBEDTLS_LARGE_KEY_SOFTWARE_MPI is not set
# CONFIG_MBEDTLS_SECURITY_RISKS is not set
# end of mbedTLS

#
# mDNS
#
                                                                                                                                                                                                            CONFIG_MDNS_MAX_SERVICES=10
    CONFIG_MDNS_TASK_PRIORITY=1
    CONFIG_MDNS_TASK_STACK_SIZE=4096
# CONFIG_MDNS_TASK_AFFINITY_NO_AFFINITY is not set
    CONFIG_MDNS_TASK_AFFINITY_CPU0=y
# CONFIG_MDNS_TASK_AFFINITY_CPU1 is not set
        CONFIG_MDNS_TASK_AFFINITY=0x0
    CONFIG_MDNS_SERVICE_ADD_TIMEOUT_MS=2000
# CONFIG_MDNS_STRICT_MODE is not set
    CONFIG_MDNS_TIMER_PERIOD_MS=100
# CONFIG_MDNS_NETWORKING_SOCKET is not set
    CONFIG_MDNS_MULTIPLE_INSTANCE=y
# end of mDNS

#
# ESP-MQTT Configurations
#
        CONFIG_MQTT_PROTOCOL_311=y
            CONFIG_MQTT_TRANSPORT_SSL=y
                CONFIG_MQTT_TRANSPORT_WEBSOCKET=y
                    CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE=y
# CONFIG_MQTT_MSG_ID_INCREMENTAL is not set
# CONFIG_MQTT_SKIP_PUBLISH_IF_DISCONNECTED is not set
# CONFIG_MQTT_REPORT_DELETED_MESSAGES is not set
# CONFIG_MQTT_USE_CUSTOM_CONFIG is not set
# CONFIG_MQTT_TASK_CORE_SELECTION_ENABLED is not set
# CONFIG_MQTT_CUSTOM_OUTBOX is not set
# end of ESP-MQTT Configurations

#
# Newlib
#
                        CONFIG_NEWLIB_STDOUT_LINE_ENDING_CRLF=y
# CONFIG_NEWLIB_STDOUT_LINE_ENDING_LF is not set
# CONFIG_NEWLIB_STDOUT_LINE_ENDING_CR is not set
# CONFIG_NEWLIB_STDIN_LINE_ENDING_CRLF is not set
# CONFIG_NEWLIB_STDIN_LINE_ENDING_LF is not set
                            CONFIG_NEWLIB_STDIN_LINE_ENDING_CR=y
# CONFIG_NEWLIB_NANO_FORMAT is not set
# end of Newlib

#
# NVS
#
# end of NVS

#
# OpenSSL
#
# CONFIG_OPENSSL_DEBUG is not set
                                CONFIG_OPENSSL_ERROR_STACK=y
                                    CONFIG_OPENSSL_ASSERT_DO_NOTHING=y
# CONFIG_OPENSSL_ASSERT_EXIT is not set
# end of OpenSSL

#
# OpenThread
#
# CONFIG_OPENTHREAD_ENABLED is not set
# end of OpenThread

#
# PThreads
#
                                        CONFIG_PTHREAD_TASK_PRIO_DEFAULT=5
    CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=3072
    CONFIG_PTHREAD_STACK_MIN=768
# CONFIG_PTHREAD_DEFAULT_CORE_NO_AFFINITY is not set
# CONFIG_PTHREAD_DEFAULT_CORE_0 is not set
    CONFIG_PTHREAD_DEFAULT_CORE_1=y
        CONFIG_PTHREAD_TASK_CORE_DEFAULT=1
    CONFIG_PTHREAD_TASK_NAME_DEFAULT="pthread"
# end of PThreads

#
# SPI Flash driver
#
# CONFIG_SPI_FLASH_VERIFY_WRITE is not set
# CONFIG_SPI_FLASH_ENABLE_COUNTERS is not set
    CONFIG_SPI_FLASH_ROM_DRIVER_PATCH=y
        CONFIG_SPI_FLASH_DANGEROUS_WRITE_ABORTS=y
# CONFIG_SPI_FLASH_DANGEROUS_WRITE_FAILS is not set
# CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED is not set
# CONFIG_SPI_FLASH_USE_LEGACY_IMPL is not set
# CONFIG_SPI_FLASH_SHARE_SPI1_BUS is not set
# CONFIG_SPI_FLASH_BYPASS_BLOCK_ERASE is not set
            CONFIG_SPI_FLASH_YIELD_DURING_ERASE=y
                CONFIG_SPI_FLASH_ERASE_YIELD_DURATION_MS=20
    CONFIG_SPI_FLASH_ERASE_YIELD_TICKS=1
    CONFIG_SPI_FLASH_WRITE_CHUNK_SIZE=8192
# CONFIG_SPI_FLASH_SIZE_OVERRIDE is not set
# CONFIG_SPI_FLASH_CHECK_ERASE_TIMEOUT_DISABLED is not set
# CONFIG_SPI_FLASH_OVERRIDE_CHIP_DRIVER_LIST is not set

#
# Auto-detect flash chips
#
    CONFIG_SPI_FLASH_SUPPORT_ISSI_CHIP=y
        CONFIG_SPI_FLASH_SUPPORT_MXIC_CHIP=y
            CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y
                CONFIG_SPI_FLASH_SUPPORT_WINBOND_CHIP=y
# end of Auto-detect flash chips

                    CONFIG_SPI_FLASH_ENABLE_ENCRYPTED_READ_WRITE=y
# end of SPI Flash driver

#
# SPIFFS Configuration
#
                        CONFIG_SPIFFS_MAX_PARTITIONS=3

#
# SPIFFS Cache Configuration
#
# CONFIG_SPIFFS_CACHE is not set
# end of SPIFFS Cache Configuration

    CONFIG_SPIFFS_PAGE_CHECK=y
        CONFIG_SPIFFS_GC_MAX_RUNS=10
# CONFIG_SPIFFS_GC_STATS is not set
    CONFIG_SPIFFS_PAGE_SIZE=256
    CONFIG_SPIFFS_OBJ_NAME_LEN=32
# CONFIG_SPIFFS_FOLLOW_SYMLINKS is not set
    CONFIG_SPIFFS_USE_MAGIC=y
        CONFIG_SPIFFS_USE_MAGIC_LENGTH=y
            CONFIG_SPIFFS_META_LENGTH=4
    CONFIG_SPIFFS_USE_MTIME=y

#
# Debug Configuration
#
# CONFIG_SPIFFS_DBG is not set
# CONFIG_SPIFFS_API_DBG is not set
# CONFIG_SPIFFS_GC_DBG is not set
# CONFIG_SPIFFS_CHECK_DBG is not set
# CONFIG_SPIFFS_TEST_VISUALISATION is not set
# end of Debug Configuration
# end of SPIFFS Configuration

#
# TCP Transport
#

#
# Websocket
#
        CONFIG_WS_TRANSPORT=y
            CONFIG_WS_BUFFER_SIZE=1024
# end of Websocket
# end of TCP Transport

#
# Unity unit testing library
#
    CONFIG_UNITY_ENABLE_FLOAT=y
        CONFIG_UNITY_ENABLE_DOUBLE=y
# CONFIG_UNITY_ENABLE_64BIT is not set
# CONFIG_UNITY_ENABLE_COLOR is not set
            CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=y
# CONFIG_UNITY_ENABLE_FIXTURE is not set
# CONFIG_UNITY_ENABLE_BACKTRACE_ON_FAIL is not set
# end of Unity unit testing library

#
# Virtual file system
#
                CONFIG_VFS_SUPPORT_IO=y
                    CONFIG_VFS_SUPPORT_DIR=y
                        CONFIG_VFS_SUPPORT_SELECT=y
                            CONFIG_VFS_SUPPRESS_SELECT_DEBUG_OUTPUT=y
                                CONFIG_VFS_SUPPORT_TERMIOS=y

#
# Host File System I/O (Semihosting)
#
                                    CONFIG_VFS_SEMIHOSTFS_MAX_MOUNT_POINTS=1
    CONFIG_VFS_SEMIHOSTFS_HOST_PATH_MAX_LEN=128
# end of Host File System I/O (Semihosting)
# end of Virtual file system

#
# Wear Levelling
#
    CONFIG_WL_SECTOR_SIZE_512=y
# CONFIG_WL_SECTOR_SIZE_4096 is not set
        CONFIG_WL_SECTOR_SIZE=512
    CONFIG_WL_SECTOR_MODE_PERF=y
# CONFIG_WL_SECTOR_MODE_SAFE is not set
        CONFIG_WL_SECTOR_MODE=0
# end of Wear Levelling

#
# Wi-Fi Provisioning Manager
#
    CONFIG_WIFI_PROV_SCAN_MAX_ENTRIES=16
    CONFIG_WIFI_PROV_AUTOSTOP_TIMEOUT=30
# CONFIG_WIFI_PROV_BLE_BONDING is not set
# end of Wi-Fi Provisioning Manager

#
# Supplicant
#
    CONFIG_WPA_MBEDTLS_CRYPTO=y
# CONFIG_WPA_WAPI_PSK is not set
# CONFIG_WPA_SUITE_B_192 is not set
# CONFIG_WPA_DEBUG_PRINT is not set
# CONFIG_WPA_TESTING_OPTIONS is not set
# CONFIG_WPA_WPS_STRICT is not set
# CONFIG_WPA_11KV_SUPPORT is not set
# end of Supplicant
# end of Component config

#
# Compatibility options
#
# CONFIG_LEGACY_INCLUDE_COMMON_HEADERS is not set
# end of Compatibility options

