muvox-io/euphonium/targets/esp32/app/sdkconfig.defaults
# Deprecated options for backward compatibility
        CONFIG_TOOLPREFIX="xtensa-esp32-elf-"
# CONFIG_LOG_BOOTLOADER_LEVEL_NONE is not set
# CONFIG_LOG_BOOTLOADER_LEVEL_ERROR is not set
# CONFIG_LOG_BOOTLOADER_LEVEL_WARN is not set
    CONFIG_LOG_BOOTLOADER_LEVEL_INFO=y
# CONFIG_LOG_BOOTLOADER_LEVEL_DEBUG is not set
# CONFIG_LOG_BOOTLOADER_LEVEL_VERBOSE is not set
        CONFIG_LOG_BOOTLOADER_LEVEL=3
# CONFIG_APP_ROLLBACK_ENABLE is not set
# CONFIG_FLASH_ENCRYPTION_ENABLED is not set
    CONFIG_FLASHMODE_QIO=y
# CONFIG_FLASHMODE_QOUT is not set
# CONFIG_FLASHMODE_DIO is not set
# CONFIG_FLASHMODE_DOUT is not set
# CONFIG_MONITOR_BAUD_9600B is not set
# CONFIG_MONITOR_BAUD_57600B is not set
        CONFIG_MONITOR_BAUD_115200B=y
# CONFIG_MONITOR_BAUD_230400B is not set
# CONFIG_MONITOR_BAUD_921600B is not set
# CONFIG_MONITOR_BAUD_2MB is not set
# CONFIG_MONITOR_BAUD_OTHER is not set
            CONFIG_MONITOR_BAUD_OTHER_VAL=115200
    CONFIG_MONITOR_BAUD=115200
# CONFIG_COMPILER_OPTIMIZATION_LEVEL_DEBUG is not set
    CONFIG_COMPILER_OPTIMIZATION_LEVEL_RELEASE=y
        CONFIG_OPTIMIZATION_ASSERTIONS_ENABLED=y
# CONFIG_OPTIMIZATION_ASSERTIONS_SILENT is not set
# CONFIG_OPTIMIZATION_ASSERTIONS_DISABLED is not set
            CONFIG_OPTIMIZATION_ASSERTION_LEVEL=2
    CONFIG_CXX_EXCEPTIONS=y
        CONFIG_CXX_EXCEPTIONS_EMG_POOL_SIZE=0
    CONFIG_STACK_CHECK_NONE=y
# CONFIG_STACK_CHECK_NORM is not set
# CONFIG_STACK_CHECK_STRONG is not set
# CONFIG_STACK_CHECK_ALL is not set
# CONFIG_WARN_WRITE_STRINGS is not set
# CONFIG_DISABLE_GCC8_WARNINGS is not set
# CONFIG_ESP32_APPTRACE_DEST_TRAX is not set
        CONFIG_ESP32_APPTRACE_DEST_NONE=y
            CONFIG_ESP32_APPTRACE_LOCK_ENABLE=y
# CONFIG_BTDM_CONTROLLER_MODE_BLE_ONLY is not set
                CONFIG_BTDM_CONTROLLER_MODE_BR_EDR_ONLY=y
# CONFIG_BTDM_CONTROLLER_MODE_BTDM is not set
                    CONFIG_BTDM_CONTROLLER_BR_EDR_MAX_ACL_CONN=2
    CONFIG_BTDM_CONTROLLER_BR_EDR_MAX_SYNC_CONN=0
    CONFIG_BTDM_CONTROLLER_BLE_MAX_CONN_EFF=0
    CONFIG_BTDM_CONTROLLER_BR_EDR_MAX_ACL_CONN_EFF=2
    CONFIG_BTDM_CONTROLLER_BR_EDR_MAX_SYNC_CONN_EFF=0
    CONFIG_BTDM_CONTROLLER_PINNED_TO_CORE=0
    CONFIG_BTDM_CONTROLLER_HCI_MODE_VHCI=y
# CONFIG_BTDM_CONTROLLER_HCI_MODE_UART_H4 is not set
        CONFIG_BTDM_CONTROLLER_MODEM_SLEEP=y
            CONFIG_BLUEDROID_ENABLED=y
# CONFIG_NIMBLE_ENABLED is not set
                CONFIG_BTC_TASK_STACK_SIZE=3072
# CONFIG_BLUEDROID_PINNED_TO_CORE_0 is not set
    CONFIG_BLUEDROID_PINNED_TO_CORE_1=y
        CONFIG_BLUEDROID_PINNED_TO_CORE=1
    CONFIG_BTU_TASK_STACK_SIZE=4096
# CONFIG_BLUEDROID_MEM_DEBUG is not set
    CONFIG_CLASSIC_BT_ENABLED=y
        CONFIG_A2DP_ENABLE=y
# CONFIG_HFP_ENABLE is not set
# CONFIG_BLE_HOST_QUEUE_CONGESTION_CHECK is not set
            CONFIG_SMP_ENABLE=y
                CONFIG_BLE_ESTABLISH_LINK_CONNECTION_TIMEOUT=30
    CONFIG_ADC2_DISABLE_DAC=y
        CONFIG_SPIRAM_SUPPORT=y
            CONFIG_WIFI_LWIP_ALLOCATION_FROM_SPIRAM_FIRST=y
                CONFIG_TRACEMEM_RESERVE_DRAM=0x0
# CONFIG_ULP_COPROC_ENABLED is not set
    CONFIG_ULP_COPROC_RESERVE_MEM=0
    CONFIG_BROWNOUT_DET=y
        CONFIG_BROWNOUT_DET_LVL_SEL_0=y
# CONFIG_BROWNOUT_DET_LVL_SEL_1 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_2 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_3 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_4 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_5 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_6 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_7 is not set
            CONFIG_BROWNOUT_DET_LVL=0
    CONFIG_ESP32_RTC_CLOCK_SOURCE_INTERNAL_RC=y
# CONFIG_ESP32_RTC_CLOCK_SOURCE_EXTERNAL_CRYSTAL is not set
# CONFIG_ESP32_RTC_CLOCK_SOURCE_EXTERNAL_OSC is not set
# CONFIG_ESP32_RTC_CLOCK_SOURCE_INTERNAL_8MD256 is not set
# CONFIG_DISABLE_BASIC_ROM_CONSOLE is not set
# CONFIG_COMPATIBLE_PRE_V2_1_BOOTLOADERS is not set
# CONFIG_EVENT_LOOP_PROFILING is not set
        CONFIG_POST_EVENTS_FROM_ISR=y
            CONFIG_POST_EVENTS_FROM_IRAM_ISR=y
# CONFIG_TWO_UNIVERSAL_MAC_ADDRESS is not set
                CONFIG_FOUR_UNIVERSAL_MAC_ADDRESS=y
                    CONFIG_NUMBER_OF_UNIVERSAL_MAC_ADDRESS=4
# CONFIG_ESP32C3_LIGHTSLEEP_GPIO_RESET_WORKAROUND is not set
    CONFIG_IPC_TASK_STACK_SIZE=1024
    CONFIG_ESP32_PHY_CALIBRATION_AND_DATA_STORAGE=y
# CONFIG_ESP32_PHY_INIT_DATA_IN_PARTITION is not set
        CONFIG_ESP32_PHY_MAX_WIFI_TX_POWER=20
    CONFIG_ESP32_PHY_MAX_TX_POWER=20
    CONFIG_ESP32_REDUCE_PHY_TX_POWER=y
# CONFIG_ESP32S2_PANIC_PRINT_HALT is not set
        CONFIG_ESP32S2_PANIC_PRINT_REBOOT=y
# CONFIG_ESP32S2_PANIC_SILENT_REBOOT is not set
# CONFIG_ESP32S2_PANIC_GDBSTUB is not set
            CONFIG_SYSTEM_EVENT_QUEUE_SIZE=32
    CONFIG_SYSTEM_EVENT_TASK_STACK_SIZE=2304
    CONFIG_MAIN_TASK_STACK_SIZE=8192
    CONFIG_CONSOLE_UART_DEFAULT=y
# CONFIG_CONSOLE_UART_CUSTOM is not set
# CONFIG_ESP_CONSOLE_UART_NONE is not set
        CONFIG_CONSOLE_UART=y
            CONFIG_CONSOLE_UART_NUM=0
    CONFIG_CONSOLE_UART_BAUDRATE=115200
    CONFIG_INT_WDT=y
        CONFIG_INT_WDT_TIMEOUT_MS=800
    CONFIG_INT_WDT_CHECK_CPU1=y
        CONFIG_TASK_WDT=y
# CONFIG_TASK_WDT_PANIC is not set
            CONFIG_TASK_WDT_TIMEOUT_S=5
    CONFIG_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
        CONFIG_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
            CONFIG_TIMER_TASK_STACK_SIZE=3584
    CONFIG_SW_COEXIST_ENABLE=y
        CONFIG_ESP32_ENABLE_COREDUMP_TO_UART=y
# CONFIG_ESP32_ENABLE_COREDUMP_TO_NONE is not set
# CONFIG_ESP32_COREDUMP_DATA_FORMAT_BIN is not set
            CONFIG_ESP32_COREDUMP_DATA_FORMAT_ELF=y
                CONFIG_ESP32_COREDUMP_CHECKSUM_CRC32=y
# CONFIG_ESP32_COREDUMP_CHECKSUM_SHA256 is not set
                    CONFIG_ESP32_ENABLE_COREDUMP=y
                        CONFIG_ESP32_CORE_DUMP_MAX_TASKS_NUM=64
    CONFIG_ESP32_CORE_DUMP_UART_DELAY=0
    CONFIG_ESP32_CORE_DUMP_DECODE_INFO=y
# CONFIG_ESP32_CORE_DUMP_DECODE_DISABLE is not set
        CONFIG_ESP32_CORE_DUMP_DECODE="info"
    CONFIG_MB_MASTER_TIMEOUT_MS_RESPOND=150
    CONFIG_MB_MASTER_DELAY_MS_CONVERT=200
    CONFIG_MB_QUEUE_LENGTH=20
    CONFIG_MB_SERIAL_TASK_STACK_SIZE=4096
    CONFIG_MB_SERIAL_BUF_SIZE=256
    CONFIG_MB_SERIAL_TASK_PRIO=10
# CONFIG_MB_CONTROLLER_SLAVE_ID_SUPPORT is not set
    CONFIG_MB_CONTROLLER_NOTIFY_TIMEOUT=20
    CONFIG_MB_CONTROLLER_NOTIFY_QUEUE_SIZE=20
    CONFIG_MB_CONTROLLER_STACK_SIZE=4096
    CONFIG_MB_EVENT_QUEUE_TIMEOUT=20
    CONFIG_MB_TIMER_PORT_ENABLED=y
        CONFIG_MB_TIMER_GROUP=0
    CONFIG_MB_TIMER_INDEX=0
# CONFIG_ENABLE_STATIC_TASK_CLEAN_UP_HOOK is not set
    CONFIG_TIMER_TASK_PRIORITY=1
    CONFIG_TIMER_TASK_STACK_DEPTH=2432
    CONFIG_TIMER_QUEUE_LENGTH=10
# CONFIG_L2_TO_L3_COPY is not set
# CONFIG_USE_ONLY_LWIP_SELECT is not set
    CONFIG_ESP_GRATUITOUS_ARP=y
        CONFIG_GARP_TMR_INTERVAL=60
    CONFIG_TCPIP_RECVMBOX_SIZE=32
    CONFIG_TCP_MAXRTX=12
    CONFIG_TCP_SYNMAXRTX=6
    CONFIG_TCP_MSS=1440
    CONFIG_TCP_MSL=60000
    CONFIG_TCP_SND_BUF_DEFAULT=8192
    CONFIG_TCP_WND_DEFAULT=32768
    CONFIG_TCP_RECVMBOX_SIZE=32
    CONFIG_TCP_QUEUE_OOSEQ=y
# CONFIG_ESP_TCP_KEEP_CONNECTION_WHEN_IP_CHANGES is not set
        CONFIG_TCP_OVERSIZE_MSS=y
# CONFIG_TCP_OVERSIZE_QUARTER_MSS is not set
# CONFIG_TCP_OVERSIZE_DISABLE is not set
            CONFIG_UDP_RECVMBOX_SIZE=32
    CONFIG_TCPIP_TASK_STACK_SIZE=3072
    CONFIG_TCPIP_TASK_AFFINITY_NO_AFFINITY=y
# CONFIG_TCPIP_TASK_AFFINITY_CPU0 is not set
# CONFIG_TCPIP_TASK_AFFINITY_CPU1 is not set
        CONFIG_TCPIP_TASK_AFFINITY=0x7FFFFFFF
# CONFIG_PPP_SUPPORT is not set
    CONFIG_ESP32_PTHREAD_TASK_PRIO_DEFAULT=5
    CONFIG_ESP32_PTHREAD_TASK_STACK_SIZE_DEFAULT=3072
    CONFIG_ESP32_PTHREAD_STACK_MIN=768
# CONFIG_ESP32_DEFAULT_PTHREAD_CORE_NO_AFFINITY is not set
# CONFIG_ESP32_DEFAULT_PTHREAD_CORE_0 is not set
    CONFIG_ESP32_DEFAULT_PTHREAD_CORE_1=y
        CONFIG_ESP32_PTHREAD_TASK_CORE_DEFAULT=1
    CONFIG_ESP32_PTHREAD_TASK_NAME_DEFAULT="pthread"
    CONFIG_SPI_FLASH_WRITING_DANGEROUS_REGIONS_ABORTS=y
# CONFIG_SPI_FLASH_WRITING_DANGEROUS_REGIONS_FAILS is not set
# CONFIG_SPI_FLASH_WRITING_DANGEROUS_REGIONS_ALLOWED is not set
        CONFIG_SUPPRESS_SELECT_DEBUG_OUTPUT=y
            CONFIG_SUPPORT_TERMIOS=y
                CONFIG_SEMIHOSTFS_MAX_MOUNT_POINTS=1
    CONFIG_SEMIHOSTFS_HOST_PATH_MAX_LEN=128
# End of deprecated options
